{ "datajson":
[
    {
        "bootcamp":"Full Stack JavaScript",
        "questions": 
        [
            {
                "id": 1,
                "Pregunta": "1. ¿Cuál es tu lenguaje favorito y por qué? ",
                "Respuesta": "Mi lenguaje de programación favorito en este momento es Python, porque me permite implementar múltiples funcionalidades usando menos código. El ecosistema que ofrece Python es bastante cómodo para trabajar, ya que ofrece buenas bibliotecas para un sinfín de cosas."
            },
            {
                "id": 2,
                "Pregunta": "2. ¿Cuáles han sido tus responsabilidades anteriores en el puesto como desarrollador full-stack? ",
                "Respuesta": "En mi puesto anterior, fui responsable de múltiples actividades de codificación clave y que requerían la gestión general del proyecto. Por ejemplo, me encargué de crear el código de prueba que serviría para probar, monitorear y asegurar el rendimiento de las aplicaciones. Solía reunirme con los clientes para entender en profundidad sus necesidades y adaptarme a su proyecto."
            },
            {
                "id": 3,
                "Pregunta": "3. ¿Cómo mantienes tus conocimientos actualizados? ",
                "Respuesta": "Para mí, la educación constante y la actualización de mis conocimientos es un elemento esencial. Por ello, suelo asistir a eventos y seminarios sobre tecnología que presentan nuevos productos, herramientas y extensiones que me servirán para mejorar mi trabajo. En añadido, leo habitualmente blogs y revistas especializadas en programación para descubrir las tendencias relevantes."
            },
            {
                "id": 4,
                "Pregunta": "4. ¿Qué factores consideras al codificar respecto al SEO?",
                "Respuesta": "Hay una serie de estándares clave que siempre implemento en mi código. Algunos de ellos son la especificación de una etiqueta alt en cualquier imagen, etiquetas HTML precisas para la jerarquía de los contenidos, SSL habilitado e integración con Google Ads. Esto influye positivamente en el posicionamiento SEO, debido a que permite clasificar de forma orgánica a un sitio web en los motores de búsqueda."
            },
            {
                "id": 5,
                "Pregunta": "5. ¿Cuáles son los principales desafíos de trabajar como desarrollador full-stack?",
                "Respuesta": "La labor de un desarrollador full stack es muy amplia, ya que amerita una amplia gama de habilidades de programación, codificación y análisis. Para mí, uno de los principales retos de la profesión es dominar por completo cada una de las áreas de trabajo que tiene. Generalmente, me apoyo de los conocimientos técnicos y competencias en el campo, junto con los aportes individuales de los miembros de mi equipo para llevar a cabo proyectos eficientes."
            },
            {
                "id": 6,
                "Pregunta": "6. ¿Cuáles son los casos más comunes de uso para Docker?",
                "Respuesta": "A pesar de no tener experiencia previa con Docker, en mi anterior puesto aprendí sobre algunos de los beneficios que ofrece. Es recomendable para crear cajas de prueba y facilitar las pruebas para la integración continua. Uno de mis objetivos a corto plazo es aprovechar Docker para encapsular aplicaciones heredades y obtener competencia en su utilización."
            },
            {
                "id": 7,
                "Pregunta": "7. ¿Qué beneficios tiene para ti el empleo de CommonJS?",
                "Respuesta": "CommonJS es un diseño del lado del servidor, por lo que considero que es una excelente alternativa para escribir declaraciones y módulos de importación. También sirve para cambiar entre el desarrollo del lado del servidor y del cliente con JavaScript. Por último, ofrece facilidad de uso gracias a su sintaxis."
            },
            {
                "id": 8,
                "Pregunta": "8. ¿En qué consiste CORS y qué beneficios ofrece?",
                "Respuesta": "CORS es una abreviatura de intercambio de recursos de origen cruzado, que es uno de los procesos que utilizo para acceder a los recursos web de diferentes dominios. Yo lo recomiendo especialmente para integrar secuencias de comandos web, porque es posible hacerlo de una manera más abierta con el contenido externo del dominio original. Como resultado, se consigue una integración fluida entre dos o más servicios web."
            },
            {
                "id": 9,
                "Pregunta": "9. ¿Cuáles son las estrategias que empleas para evitar que los bots raspen las API de acceso público?",
                "Respuesta": "Si los datos de la API son de acceso público, técnicamente es imposible evitar el raspado de datos por completo. No obstante, una solución efectiva que disuade a la mayoría de bots es la limitación de la velocidad o aceleración. Esto evita que algunos dispositivos realicen demasiadas solicitudes en un periodo de tiempo específico."
            },
            {
                "id": 10,
                "Pregunta": "10. ¿En qué consiste el\"modo estricto\" y cuáles son las principales ventajas que tiene?",
                "Respuesta": "El\"use strict\" o modo estricto es una funcionalidad que indica el modo en que un navegador debe ejecutar el código de JavaScript. Puede ser una de las interrogantes de entrevista para desarrollador full stack, ya que le ofrece al entrevistador una orientación sobre tu capacidad para aprovechar herramientas de diferentes tipos en tus proyectos. Tu respuesta debe mostrar tu adaptabilidad para utilizar herramientas de desarrollo de todo tipo."
            }
        ]
    },{
        "bootcamp":"Front End",
        "questions": 
        [
            {
                "id": 11,
                "Pregunta": "1. ¿Cuáles son los retos que has enfrentado como Desarrollador Front-End?",
                "Respuesta": "Adaptación a los constantes cambios de los lenguajes de programación, frameworks o librerías. Optimización del sitio según los resultados mostrados por Lighthouse.Asegurarse de que cada botón, menú, panel o enlace funcione correctamente. Creación de un sitio funcional y atractivo para el cliente. Depuración del código que compone la interfaz. El candidato indicará los retos que enfrentó en los proyectos en los que participó. Por tal motivo, mencionará cuáles son los problemas más recurrentes cuando se desarrolla la interfaz de un sitio o app. Además, hablará de los conocimientos que obtuvo de cada situación que enfrentó."                
            },
            {
                "id": 12,
                "Pregunta": "2. ¿Qué técnicas de optimización has usado para mejorar el rendimiento de un sitio web?",
                "Respuesta": "Minificación: requiere de la eliminación de saltos de línea, atributos, espacios, duplicados y recorte de nombres de clases en los códigos HTML, CSS y JavaScript que componen al sitio. Escritura del código: un código organizado permitirá la correcta carga de todos los elementos de la página sin crear demoras ni errores en la renderización. Compresión: reduce el tamaño de los archivos HTML, CSS y JavaScript de la plataforma. Lo cual mejora la capacidad de respuesta del sitio. Diseño responsivo: implementación de una versión del sitio que responda correctamente cuando el usuario interactúa a través de un dispositivo móvil. Optimización de imágenes: la reducción del tamaño de las imágenes en el sitio mejora la velocidad de carga del mismo. Reducción de scripts de terceros: los scripts son fragmentos de código que añaden funcionalidades al sitio. No obstante, su implementación puede afectar el rendimiento del sitio. Almacenamiento en caché: cuando los usuarios reingresan a una página, esta se cargará más rápido gracias a los datos que el navegador guardó previamente. El candidato mencionará las técnicas que utiliza para optimizar un sitio web. Destacará que la implementación de estos métodos mejora el rendimiento y velocidad del sitio. Además, de que así logra que los usuarios tengan una mejor experiencia."
            },
            {
                "id": 13,
                "Pregunta": "3. ¿En qué proyectos de desarrollo web has participado?, ¿cuáles son los resultados que lograste? ",
                "Respuesta": "El Desarrollador Front-End suele trabajar en proyectos como: Sitios web. Aplicaciones móviles. Videojuegos. Plataformas empresariales. Los resultados esperados son los siguientes: Mejora en la velocidad del sitio. Mejora en la experiencia ofrecida a los usuarios. Mejora en la accesibilidad y usabilidad del sitio. Posicionamiento del sitio en los primeros resultados búsqueda gracias a la optimización. El candidato hablará de los proyectos en los que participó y los resultados obtenidos en ellos. Mencionará que el objetivo es lograr una interfaz funcional para los usuarios sin importar el producto que se ofrece. Lo importante es que reconozcas si su experiencia previa se ajusta al perfil que busca la empresa."
            },
            {
                "id": 14,
                "Pregunta": "4. ¿Qué técnicas de depuración has utilizado para eliminar errores en el código durante el desarrollo?",
                "Respuesta": "Análisis estático: examinación del código antes de su ejecución. Impresión o de seguimiento: monitorea los errores que afectan el funcionamiento del sitio. Considera el uso de software que informa sobre fallos en la plataforma. Remota: depura la plataforma a través de un entorno diferente en el que es desarrollada y probada. Post-mortem: enfocada en depurar el código si el sitio experimenta fallos críticos. El candidato dirá que durante el proceso de desarrollo siempre se encuentran errores de funcionamiento en la interfaz. Por ello, son usadas cualquiera de las técnicas previamente mencionadas. Con las cuales, previene y corrige errores que provocarían que los usuarios interactúen con una plataforma que les dejaría una mala experiencia."
            },
            {
                "id": 15,
                "Pregunta": "5. ¿Has desarrollado interfaces escalables? ¿Qué prácticas implementas para lograrlo?",
                "Respuesta": "Arquitectura: combina tanto el back-end como el  front-end. El objetivo es que el sitio cuente con capacidad para recibir una gran cantidad de tráfico, y recibir actualizaciones en el diseño de la interfaz. Cobertura: un código escalable es mantenible, independiente, personalizable y legible para todo el equipo de desarrollo. Pruebas: para garantizar que la plataforma ofrece una experiencia de usuario satisfactoria. Uso de frameworks: facilitan la creación de un sitio en menos tiempo, utilizando fragmentos de código previamente utilizado en otros proyectos. Uso de caché: permite una navegación rápida y la reducción de solicitudes de back-end no deseadas. El candidato mencionará los proyectos de escalamiento front-end en los que participó. Por ello, hablará de las prácticas con las que asegura el rendimiento de un sitio, garantizando la usabilidad de la plataforma a pesar de un aumento exponencial de usuarios."
            },
            {
                "id": 16,
                "Pregunta": "6. Explique cómo se aseguraría de que su diseño web sea fácil de usar y qué pasos tomaría para lograrlo.",
                "Respuesta": "Un desarrollador front-end necesita comunicarse con frecuencia y trabajar junto con diseñadores de UX (Experiencia de usuario) para imaginar y conceptualizar una página web que diseñe una experiencia centrada en el usuario, probar el sitio web con los usuarios para garantizar un diseño óptimo y garantizar que la página web o el sitio está optimizado para la navegación de teléfonos móviles. Si no tenemos un diseñador de UX a mano, ejecutaríamos pruebas de usuario o grabaciones de usuarios como Hotjar para asegurarnos de que no haya bloqueadores de UX en el diseño web o la aplicación web que estamos desarrollando."
            },
            {
                "id": 17,
                "Pregunta": "7. ¿Cómo estructura su código fuente para que sea fácil de usar por sus colegas?",
                "Respuesta": "Un desarrollador front-end necesita usar estándares comunes y explicar su uso de la organización del código y los comentarios. Deben explicar cómo usan las notas en su proceso de programación para explicar los pasos que han dado, asegurando así la eficiencia de la comprensión entre los colaboradores. Si existen estándares para comentar o documentar el código en la empresa, es necesario adherirse a estos estándares."
            },
            {
                "id": 18,
                "Pregunta": "8. Explique cuál es la diferencia entre la herencia de clase y prototipo en Javascript.",
                "Respuesta": "La herencia en JavaScript es diferente a la mayoría de los otros lenguajes de programación. El sistema de objetos en JavaScript está basado en prototipos, no en clases. Los objetos en JavaScript son solo una colección de pares de nombre (clave) y valor. Cuando se trata de herencia, JavaScript solo tiene una construcción: objetos. Cada objeto tiene una propiedad privada que contiene un enlace a otro objeto llamado su prototipo."
            },
            {
                "id": 19,
                "Pregunta": "9. Explique cuál es la diferencia entre una solicitud GET y POST.",
                "Respuesta": "Tanto el método GET como el POST se utilizan para transferir datos del cliente al servidor en el protocolo HTTP. La principal diferencia entre el método POST y GET es que GET lleva parámetros de solicitud agregados en la cadena de URL, mientras que POST lleva el parámetro de solicitud en el cuerpo del mensaje, lo que lo convierte en una forma más segura de transferir datos de cliente a servidor en HTTP."
                
            },
            {
                "id": 20,
                "Pregunta": "10. ¿Explica la importancia del HTML DOCTYPE?",
                "Respuesta": "DOCTYPE es una instrucción para el navegador web sobre la versión del lenguaje de marcado en el que está escrita la página. La declaración DOCTYPE debe ser lo primero en su documento HTML, antes de etiqueta. La declaración Doctype apunta a una definición de tipo de documento (DTD). El tipo de documento proporciona reglas de lenguaje de marcado, por lo que un navegador puede interpretar el contenido correctamente." 
            }
        ]
    }
]
}


