{ "datajson":
[
    {
        "bootcamp":"Full Stack JavaScript",
        "questions": 
        [
            {
                "id": 1,
                "Pregunta": "1. ¿Cuál es tu lenguaje favorito y por qué? ",
                "Respuesta": "Mi lenguaje de programación favorito en este momento es Python, porque me permite implementar múltiples funcionalidades usando menos código. El ecosistema que ofrece Python es bastante cómodo para trabajar, ya que ofrece buenas bibliotecas para un sinfín de cosas."
            },
            {
                "id": 2,
                "Pregunta": "2. ¿Cuáles han sido tus responsabilidades anteriores en el puesto como desarrollador full-stack? ",
                "Respuesta": "En mi puesto anterior, fui responsable de múltiples actividades de codificación clave y que requerían la gestión general del proyecto. Por ejemplo, me encargué de crear el código de prueba que serviría para probar, monitorear y asegurar el rendimiento de las aplicaciones. Solía reunirme con los clientes para entender en profundidad sus necesidades y adaptarme a su proyecto."
            },
            {
                "id": 3,
                "Pregunta": "3. ¿Cómo mantienes tus conocimientos actualizados? ",
                "Respuesta": "Para mí, la educación constante y la actualización de mis conocimientos es un elemento esencial. Por ello, suelo asistir a eventos y seminarios sobre tecnología que presentan nuevos productos, herramientas y extensiones que me servirán para mejorar mi trabajo. En añadido, leo habitualmente blogs y revistas especializadas en programación para descubrir las tendencias relevantes."
            },
            {
                "id": 4,
                "Pregunta": "4. ¿Qué factores consideras al codificar respecto al SEO?",
                "Respuesta": "Hay una serie de estándares clave que siempre implemento en mi código. Algunos de ellos son la especificación de una etiqueta alt en cualquier imagen, etiquetas HTML precisas para la jerarquía de los contenidos, SSL habilitado e integración con Google Ads. Esto influye positivamente en el posicionamiento SEO, debido a que permite clasificar de forma orgánica a un sitio web en los motores de búsqueda."
            },
            {
                "id": 5,
                "Pregunta": "5. ¿Cuáles son los principales desafíos de trabajar como desarrollador full-stack?",
                "Respuesta": "La labor de un desarrollador full stack es muy amplia, ya que amerita una amplia gama de habilidades de programación, codificación y análisis. Para mí, uno de los principales retos de la profesión es dominar por completo cada una de las áreas de trabajo que tiene. Generalmente, me apoyo de los conocimientos técnicos y competencias en el campo, junto con los aportes individuales de los miembros de mi equipo para llevar a cabo proyectos eficientes."
            },
            {
                "id": 6,
                "Pregunta": "6. ¿Cuáles son los casos más comunes de uso para Docker?",
                "Respuesta": "A pesar de no tener experiencia previa con Docker, en mi anterior puesto aprendí sobre algunos de los beneficios que ofrece. Es recomendable para crear cajas de prueba y facilitar las pruebas para la integración continua. Uno de mis objetivos a corto plazo es aprovechar Docker para encapsular aplicaciones heredades y obtener competencia en su utilización."
            },
            {
                "id": 7,
                "Pregunta": "7. ¿Qué beneficios tiene para ti el empleo de CommonJS?",
                "Respuesta": "CommonJS es un diseño del lado del servidor, por lo que considero que es una excelente alternativa para escribir declaraciones y módulos de importación. También sirve para cambiar entre el desarrollo del lado del servidor y del cliente con JavaScript. Por último, ofrece facilidad de uso gracias a su sintaxis."
            },
            {
                "id": 8,
                "Pregunta": "8. ¿En qué consiste CORS y qué beneficios ofrece?",
                "Respuesta": "CORS es una abreviatura de intercambio de recursos de origen cruzado, que es uno de los procesos que utilizo para acceder a los recursos web de diferentes dominios. Yo lo recomiendo especialmente para integrar secuencias de comandos web, porque es posible hacerlo de una manera más abierta con el contenido externo del dominio original. Como resultado, se consigue una integración fluida entre dos o más servicios web."
            },
            {
                "id": 9,
                "Pregunta": "9. ¿Cuáles son las estrategias que empleas para evitar que los bots raspen las API de acceso público?",
                "Respuesta": "Si los datos de la API son de acceso público, técnicamente es imposible evitar el raspado de datos por completo. No obstante, una solución efectiva que disuade a la mayoría de bots es la limitación de la velocidad o aceleración. Esto evita que algunos dispositivos realicen demasiadas solicitudes en un periodo de tiempo específico."
            },
            {
                "id": 10,
                "Pregunta": "10. ¿En qué consiste el\"modo estricto\" y cuáles son las principales ventajas que tiene?",
                "Respuesta": "El\"use strict\" o modo estricto es una funcionalidad que indica el modo en que un navegador debe ejecutar el código de JavaScript. Puede ser una de las interrogantes de entrevista para desarrollador full stack, ya que le ofrece al entrevistador una orientación sobre tu capacidad para aprovechar herramientas de diferentes tipos en tus proyectos. Tu respuesta debe mostrar tu adaptabilidad para utilizar herramientas de desarrollo de todo tipo."
            }
        ]
    },{
        "bootcamp":"Front End",
        "questions": 
        [
            {
                "id": 11,
                "Pregunta": "1. ¿Cuáles son los retos que has enfrentado como Desarrollador Front-End?",
                "Respuesta": "Adaptación a los constantes cambios de los lenguajes de programación, frameworks o librerías. Optimización del sitio según los resultados mostrados por Lighthouse. Asegurarse de que cada botón, menú, panel o enlace funcione correctamente. Creación de un sitio funcional y atractivo para el cliente. Depuración del código que compone la interfaz. El candidato indicará los retos que enfrentó en los proyectos en los que participó. Por tal motivo, mencionará cuáles son los problemas más recurrentes cuando se desarrolla la interfaz de un sitio o app. Además, hablará de los conocimientos que obtuvo de cada situación que enfrentó."                
            },
            {
                "id": 12,
                "Pregunta": "2. ¿Qué técnicas de optimización has usado para mejorar el rendimiento de un sitio web?",
                "Respuesta": "Minificación: requiere de la eliminación de saltos de línea, atributos, espacios, duplicados y recorte de nombres de clases en los códigos HTML, CSS y JavaScript que componen al sitio. Escritura del código: un código organizado permitirá la correcta carga de todos los elementos de la página sin crear demoras ni errores en la renderización. Compresión: reduce el tamaño de los archivos HTML, CSS y JavaScript de la plataforma. Lo cual mejora la capacidad de respuesta del sitio. Diseño responsivo: implementación de una versión del sitio que responda correctamente cuando el usuario interactúa a través de un dispositivo móvil. Optimización de imágenes: la reducción del tamaño de las imágenes en el sitio mejora la velocidad de carga del mismo. Reducción de scripts de terceros: los scripts son fragmentos de código que añaden funcionalidades al sitio. No obstante, su implementación puede afectar el rendimiento del sitio. Almacenamiento en caché: cuando los usuarios reingresan a una página, esta se cargará más rápido gracias a los datos que el navegador guardó previamente. El candidato mencionará las técnicas que utiliza para optimizar un sitio web. Destacará que la implementación de estos métodos mejora el rendimiento y velocidad del sitio. Además, de que así logra que los usuarios tengan una mejor experiencia."
            },
            {
                "id": 13,
                "Pregunta": "3. ¿En qué proyectos de desarrollo web has participado?, ¿cuáles son los resultados que lograste? ",
                "Respuesta": "El Desarrollador Front-End suele trabajar en proyectos como: Sitios web. Aplicaciones móviles. Videojuegos. Plataformas empresariales. Los resultados esperados son los siguientes: Mejora en la velocidad del sitio. Mejora en la experiencia ofrecida a los usuarios. Mejora en la accesibilidad y usabilidad del sitio. Posicionamiento del sitio en los primeros resultados búsqueda gracias a la optimización. El candidato hablará de los proyectos en los que participó y los resultados obtenidos en ellos. Mencionará que el objetivo es lograr una interfaz funcional para los usuarios sin importar el producto que se ofrece. Lo importante es que reconozcas si su experiencia previa se ajusta al perfil que busca la empresa."
            },
            {
                "id": 14,
                "Pregunta": "4. ¿Qué técnicas de depuración has utilizado para eliminar errores en el código durante el desarrollo?",
                "Respuesta": "Análisis estático: examinación del código antes de su ejecución. Impresión o de seguimiento: monitorea los errores que afectan el funcionamiento del sitio. Considera el uso de software que informa sobre fallos en la plataforma. Remota: depura la plataforma a través de un entorno diferente en el que es desarrollada y probada. Post-mortem: enfocada en depurar el código si el sitio experimenta fallos críticos. El candidato dirá que durante el proceso de desarrollo siempre se encuentran errores de funcionamiento en la interfaz. Por ello, son usadas cualquiera de las técnicas previamente mencionadas. Con las cuales, previene y corrige errores que provocarían que los usuarios interactúen con una plataforma que les dejaría una mala experiencia."
            },
            {
                "id": 15,
                "Pregunta": "5. ¿Has desarrollado interfaces escalables? ¿Qué prácticas implementas para lograrlo?",
                "Respuesta": "Arquitectura: combina tanto el back-end como el  front-end. El objetivo es que el sitio cuente con capacidad para recibir una gran cantidad de tráfico, y recibir actualizaciones en el diseño de la interfaz. Cobertura: un código escalable es mantenible, independiente, personalizable y legible para todo el equipo de desarrollo. Pruebas: para garantizar que la plataforma ofrece una experiencia de usuario satisfactoria. Uso de frameworks: facilitan la creación de un sitio en menos tiempo, utilizando fragmentos de código previamente utilizado en otros proyectos. Uso de caché: permite una navegación rápida y la reducción de solicitudes de back-end no deseadas. El candidato mencionará los proyectos de escalamiento front-end en los que participó. Por ello, hablará de las prácticas con las que asegura el rendimiento de un sitio, garantizando la usabilidad de la plataforma a pesar de un aumento exponencial de usuarios."
            },
            {
                "id": 16,
                "Pregunta": "6. Explique cómo se aseguraría de que su diseño web sea fácil de usar y qué pasos tomaría para lograrlo.",
                "Respuesta": "Un desarrollador front-end necesita comunicarse con frecuencia y trabajar junto con diseñadores de UX (Experiencia de usuario) para imaginar y conceptualizar una página web que diseñe una experiencia centrada en el usuario, probar el sitio web con los usuarios para garantizar un diseño óptimo y garantizar que la página web o el sitio está optimizado para la navegación de teléfonos móviles. Si no tenemos un diseñador de UX a mano, ejecutaríamos pruebas de usuario o grabaciones de usuarios como Hotjar para asegurarnos de que no haya bloqueadores de UX en el diseño web o la aplicación web que estamos desarrollando."
            },
            {
                "id": 17,
                "Pregunta": "7. ¿Cómo estructura su código fuente para que sea fácil de usar por sus colegas?",
                "Respuesta": "Un desarrollador front-end necesita usar estándares comunes y explicar su uso de la organización del código y los comentarios. Deben explicar cómo usan las notas en su proceso de programación para explicar los pasos que han dado, asegurando así la eficiencia de la comprensión entre los colaboradores. Si existen estándares para comentar o documentar el código en la empresa, es necesario adherirse a estos estándares."
            },
            {
                "id": 18,
                "Pregunta": "8. Explique cuál es la diferencia entre la herencia de clase y prototipo en Javascript.",
                "Respuesta": "La herencia en JavaScript es diferente a la mayoría de los otros lenguajes de programación. El sistema de objetos en JavaScript está basado en prototipos, no en clases. Los objetos en JavaScript son solo una colección de pares de nombre (clave) y valor. Cuando se trata de herencia, JavaScript solo tiene una construcción: objetos. Cada objeto tiene una propiedad privada que contiene un enlace a otro objeto llamado su prototipo."
            },
            {
                "id": 19,
                "Pregunta": "9. Explique cuál es la diferencia entre una solicitud GET y POST.",
                "Respuesta": "Tanto el método GET como el POST se utilizan para transferir datos del cliente al servidor en el protocolo HTTP. La principal diferencia entre el método POST y GET es que GET lleva parámetros de solicitud agregados en la cadena de URL, mientras que POST lleva el parámetro de solicitud en el cuerpo del mensaje, lo que lo convierte en una forma más segura de transferir datos de cliente a servidor en HTTP."
                
            },
            {
                "id": 20,
                "Pregunta": "10. ¿Explica la importancia del HTML DOCTYPE?",
                "Respuesta": "DOCTYPE es una instrucción para el navegador web sobre la versión del lenguaje de marcado en el que está escrita la página. La declaración DOCTYPE debe ser lo primero en su documento HTML, antes de etiqueta. La declaración Doctype apunta a una definición de tipo de documento (DTD). El tipo de documento proporciona reglas de lenguaje de marcado, por lo que un navegador puede interpretar el contenido correctamente." 
            }
        ]
    },{
        "bootcamp": "Data-Science",
        "questions":[
            {        
                    "id": 21,          
                    "Pregunta": "1. ¿Qué es el overfitting (sobreajuste)?",
                    "Respuesta": "El sobreajuste en el aprendizaje automático se produce cuando el modelo no está bien generalizado. El modelo se centra demasiado en el conjunto de entrenamiento. Capta muchos detalles o incluso ruido en el conjunto de entrenamiento. Por lo tanto, no logra captar la tendencia general o las relaciones en los datos. Si un modelo es demasiado complejo en comparación con los datos, probablemente estará sobreajustado. Un buen indicador de sobreajuste es la gran diferencia entre la precisión de los conjuntos de entrenamiento y de prueba. Los modelos sobreajustados suelen tener una precisión muy alta en el conjunto de entrenamiento, pero la precisión de la prueba suele ser impredecible y mucho más baja que la de entrenamiento."
                },
            
            {        
                    "id": 22,          
                    "Pregunta": "2. ¿Cómo se puede reducir el overfitting?",
                    "Respuesta": "Podemos reducir el sobreajuste haciendo que el modelo sea más generalizado, lo que significa que debe centrarse más en la tendencia general que en los detalles específicos. Si es posible, recoger más datos es una forma eficaz de reducir el sobreajuste. Le darás más jugo al modelo para que tenga más material del que aprender. Los datos siempre son valiosos, especialmente para los modelos de aprendizaje automático. Otro método para reducir la sobreadaptación es reducir la complejidad del modelo. Si un modelo es demasiado complejo para una tarea determinada, es probable que se produzca un sobreajuste. En estos casos, debemos buscar modelos más sencillos."
                },
            {                  
                    "id": 23,
                    "Pregunta": "3. ¿Qué es la regularización?",
                    "Respuesta": "Hemos mencionado que la principal razón del sobreajuste es que un modelo sea más complejo de lo necesario. La regularización es un método para reducir la complejidad del modelo. Lo hace penalizando los términos más altos del modelo. Con la adición de un término de regularización, el modelo intenta minimizar tanto la pérdida como la complejidad. Los dos tipos principales de regularización son L1 y L2. La regularización L1 resta una pequeña cantidad de los pesos de las características no informativas en cada iteración. Así, hace que estos pesos se conviertan finalmente en cero. Por otro lado, la regularización L2 elimina un pequeño porcentaje de los pesos en cada iteración. Estos pesos se acercarán a cero, pero nunca llegarán a ser 0."
                },
            {                  
                    "id": 24,
                    "Pregunta": "4. ¿Cuál es la diferencia entre clasificación y agrupación?",
                    "Respuesta": "Ambas son tareas de aprendizaje automático. La clasificación es una tarea de aprendizaje supervisado, por lo que tenemos observaciones etiquetadas (es decir, puntos de datos). Entrenamos un modelo con datos etiquetados y esperamos que prediga las etiquetas de los nuevos datos. Por ejemplo, la detección de correos electrónicos no deseados es una tarea de clasificación. Proporcionamos un modelo con varios correos electrónicos marcados como spam o no spam. Una vez entrenado el modelo con esos correos, evaluará los nuevos correos de forma adecuada. La agrupación es una tarea de aprendizaje no supervisada, por lo que las observaciones no tienen etiquetas. Se espera que el modelo evalúe las observaciones y las agrupe en clusters. Las observaciones similares se colocan en el mismo clúster. En el caso óptimo, las observaciones del mismo clúster están lo más cerca posible unas de otras y los diferentes clústeres están lo más separados posible. Un ejemplo de tarea de clustering sería agrupar a los clientes en función de su comportamiento de compra. Python Las estructuras de datos incorporadas son de crucial importancia. Por lo tanto, debes estar familiarizado con lo que son y cómo interactuar con ellas. Lista, diccionario, conjunto y tupla son las 4 principales estructuras de datos incorporadas en Python."
                },
            {        
                    "id": 25,          
                    "Pregunta": "5. ¿Cuál es la diferencia entre listas y tuplas?",
                    "Respuesta": "La principal diferencia entre las listas y las tuplas es la mutabilidad. Las listas son mutables, por lo que podemos manipularlas añadiendo o eliminando elementos. mylist = [1,2,3] mylist.append(4) mylist.remove(1) print(mylist) [2,3,4]. En cambio, las tuplas son inmutables. Aunque podemos acceder a cada elemento de una tupla, no podemos modificar su contenido. mytuple = (1,2,3) mytuple.append(4) AttributeError: 'tuple' object has no attribute 'append'. Un punto importante a mencionar aquí es que aunque las tuplas son inmutables, pueden contener elementos mutables como listas o conjuntos. mytuple = (1,2,['a','b','c'])mytuple[2]['a','b','c']mytuple[2][0]=['A']print(mytuple)(1,2,[['A'],'b','c'])"
                },
            {                  
                    "id": 26,
                    "Pregunta": "6. ¿Cuál es la diferencia entre listas y sets?",
                    "Respuesta": "Hagamos un ejemplo para demostrar la principal diferencia entre listas y conjuntos. text = 'Python is awesome!' mylist = list(text) myset = set(text) print(mylist) ['P','y','t', 'h', 'o', 'n', ' ', 'i', 's', ' ', 'a', 'w', 'e', 's', 'o', 'm', 'e', '!'] print(myset) {'t', ' ', 'i', 'e', 'm', 'P', '!', 'y', 'o', 'h', 'n', 'a', 's', 'w'} Como vemos en los objetos resultantes, la lista contiene todos los caracteres de la cadena mientras que el conjunto sólo contiene valores únicos. Otra diferencia es que los caracteres de la lista están ordenados según su ubicación en la cadena. Sin embargo, los caracteres del conjunto no están ordenados."
                },
            {                  
                    "id": 27,
                    "Pregunta": "7. ¿Qué es un diccionario y cuáles son las características importantes de los diccionarios?",
                    "Respuesta": "Un diccionario en Python es una colección de pares clave-valor. Es similar a una lista en el sentido de que cada elemento de una lista tiene un índice asociado que empieza por 0. mylist = ['a', 'b', 'c'] mylist[1] 'b' En un diccionario, las claves son el índice. Así, podemos acceder a un valor utilizando su clave. mydict = {'John': 24, 'Jane': 26, 'Ashley': 22} mydict['Jane']      26 Las claves de un diccionario son únicas, lo que tiene sentido porque actúan como una dirección para los valores.SQL SQL es una habilidad extremadamente importante para los científicos de datos. Hay un gran número de empresas que almacenan sus datos en una base de datos relacional. SQL es lo que se necesita para interactuar con las bases de datos relacionales. Es probable que te hagan una pregunta que implique escribir una consulta para realizar una tarea específica. También es posible que te hagan una pregunta sobre conocimientos generales de bases de datos."
                },
            {                  
                    "id": 28,
                    "Pregunta": "8. ¿Qué es la normalización y la desnormalización en una base de datos?",
                    "Respuesta": "Estos términos están relacionados con el diseño del esquema de la base de datos. La normalización y la desnormalización tienen como objetivo optimizar diferentes métricas. El objetivo de la normalización es reducir la redundancia e inconsistencia de los datos aumentando el número de tablas. Por otro lado, la desnormalización tiene como objetivo acelerar la ejecución de la consulta. La desnormalización disminuye el número de tablas, pero al mismo tiempo añade cierta redundancia. "
                },       
            {                  
                    "id": 29,
                    "Pregunta": "9. ¿Qué técnicas de machine learning has implementado?",
                    "Respuesta": "Algunas de las técnicas de machine learning utilizadas para el desarrollo de modelos son: Árboles de decisión: predice el valor de una variable basándose en una serie de decisiones alternativas. Clasificadores lineales: clasifica los datos de acuerdo a una serie de características y patrones reconocidos en ellos. Support-vector machine: algoritmo que analiza datos para resolver problemas regresión y clasificación. Redes neuronales básicas (1 capa): son algoritmos inspirados en el cerebro humano, imitando la forma en que las neuronas biológicas se transmiten entre sí. Las redes neuronales entrenan con datos. De manera que, aprenden y mejoran su precisión con el tiempo. A partir de las herramientas anteriores se construyen modelos más avanzados: Boosting: reduce la variación y sesgo en los datos mediante la optimización constante del modelo. Random Forest: combina los valores obtenidos de diversos árboles de decisión llegando a un resultado preciso. Gradient Boosted Trees: combina escalonadamente varios árboles de decisión. Los cuales corrigen secuencialmente los errores presentados por el árbol anterior. Lo cual, posibilita una predicción precisa y la optimización constante del modelo. Deep Learning: redes neuronales de tres o más capas que aprenden y analizan grandes conjuntos de datos. Una de las redes realiza la predicción. Las dos restantes optimizan y refinan la precisión de los datos entregados. El candidato mencionará las técnicas que domina. Dirá en qué consisten, utilidad, funcionamiento y el tipo de resultados que arroja cada método. Demostrando su dominio en el desarrollo de modelos predictivos. Más aún el candidato entiende que la utilización de cada una de estas depende del problema que se esté resolviendo y los datos con que se está trabajando."
                },
            {                  
                    "id": 30,
                    "Pregunta": "10. ¿De qué forma evitas el sobreajuste en los modelos?",
                    "Respuesta": "Algunos métodos que evitan el sobreajuste son: Validación cruzada: los datos son divididos en diferentes conjuntos con los que el modelo será entrenado de manera alternada. Al menos uno de los conjuntos será utilizado para pruebas. Aumento de datos: el entrenamiento con mayor número de datos ayudaría a que el sistema detecte eficientemente patrones y tendencias. Selección de funciones útiles: consiste en la eliminación de características consideradas como innecesarias. Esto mejora el rendimiento del modelo. Regularización: reduce la variación y el riesgo de generación de sesgos. Parada anticipada: detención del entrenamiento antes de la sobrecarga del sistema. Ensamble: entrenamiento de varios modelos de predicción y análisis predictivo. Dichos modelos se combinarán posteriormente en uno solo. El candidato mencionará los métodos con los que evita el sobreajuste de los modelos. Profundizará en aquellos que le brindan resultados en el menor tiempo y costo posible. De manera que, respalda que los modelos arrojen datos confiables."
                }   
        ]
    },{
        "bootcamp": "Diseño UX-UI",
        "questions": [
            {
                "id": 31,
                "Pregunta": "1. ¿Por qué es importante el diseño de experiencia de usuario (UX)?",
                "Respuesta": "El diseño es importante porque mejora la experiencia del usuario en la plataforma. Además, esto influye directamente en la satisfacción del cliente. Lo cual, ayuda a retener mayor cantidad de usuarios y aumentar las ganancias de la empresa. Una buena respuesta está centrada en los usuarios. El candidato habla de realizar investigaciones, pruebas de usabilidad y diseño del recorrido del cliente para comprender sus necesidades. Se observa empatía y busca conocer lo que desean los usuarios del sitio web y/o aplicación móvil. Por otro lado, una mala respuesta tratará sobre el atractivo visual del sitio. Por ende, el candidato no hablará de que la interfaz debe ser funcional. Por lo cual, no garantizará que la navegación en el sitio sea fluida, ni que la  experiencia en el sitio sea agradable."
            },
            {
                "id": 32,
                "Pregunta": "2. ¿Qué significa para ti el término 'design-thinking'?",
                "Respuesta": "El 'Pensamiento de diseño' o 'Design Thinking'  es un enfoque basado en generar soluciones prácticas y creativas. Por lo que, su intención es descubrir información sobre las necesidades insatisfechas de los usuarios. Con ello, se tiene la intención de producir un resultado que beneficie tanto a los usuarios como a la empresa. El candidato dará una buena respuesta si habla de cómo lograr un diseño innovador. Debe considerar como solucionar los diferentes problemas y retos que implican realizar un diseño que pueda mantener contentos a los usuarios. Lo ideal es que su respuesta gire en torno a satisfacer las necesidades de los clientes. Habrá una mala respuesta si el candidato no ofrece soluciones innovadoras. Solo hablará de cómo el diseño le puede generar ganancias a la empresa. Por tanto, la respuesta no estaría centrada en lo que desean los usuarios de la plataforma."
            },
            {
                "id": 33,
                "Pregunta": "3. ¿Qué métodos utilizas para optimizar la experiencia de usuario?",
                "Respuesta": "Entrevistas. Encuestas presenciales y/o en línea. User persona. Auditoría de contenido. Pruebas de usabilidad. Mapas de calor. "
            },
            {
                "id": 34,
                "Pregunta": "4. ¿Cuáles son algunos desafíos a los que te enfrentaste como Diseñador UX?",
                "Respuesta": "Desafíos típicos a los que los diseñadores suelen enfrentarse en su día a día son: Justificar el diseño del sitio y/o aplicación ante los stakeholders. Realizar investigación de usuario de forma remota. Recopilación, análisis y traducción de datos del usuario. Hacer pruebas de usabilidad adecuadas durante el proceso de diseño del producto. "
            },
            {
                "id": 35,
                "Pregunta": "5. ¿Cómo mantienes al día tu conocimiento en Diseño UX?",
                "Respuesta": "Algunas formas en que un Diseñador se mantiene al día con las principales tendencias de UX son: Escuchar podcasts sobre el tema. Ver videos en canales especializados. Leer blogs y libros de UX. Asistir a seminarios web. Cursos de capacitación / bootcamps."
            },
            {
                "id": 36,
                "Pregunta": "6. ¿Cuáles consideras que son las tendencias actuales de Diseño UX? ",
                "Respuesta": "Tendencias en las que los diseñadores actualmente se fijan para el desarrollo de sus proyectos son: Plataformas impulsadas con inteligencia artificial. Diseño generativo (diseño basado en el análisis de datos). Personalización avanzada (hacer que el usuario sienta que el contenido se crea específicamente para su persona). Interacciones sin contacto (interfaz de usuario por voz). Experiencias 3D. "
            },
            {
                "id": 37,
                "Pregunta": "7. ¿Qué elementos consideras para hacer que un sitio web o plataforma sea accesible para todo tipo de usuarios? Considera, especialmente, usuarios con discapacidades visuales, auditivas y motoras.",
                "Respuesta": "Algunos puntos a tomar en cuenta para realizar un diseño inclusivo son los siguientes. Seguir las ‘Pautas de accesibilidad al contenido web’ de World Wide Web Consortium. Diseñar una interfaz que pueda ser utilizada por todos los usuarios. Realizar pruebas de usabilidad con personas con discapacidades sensoriales. Inclusión de comandos de voz para navegar por el sitio. Inclusión de subtítulos en contenido para personas problemas visuales."
            },
            {
                "id": 38,
                "Pregunta": "8. Aquí está nuestro sitio web. ¿Cómo mejorarías la experiencia de usuario en la plataforma? ",
                "Respuesta": "Aspectos comunes de mejora que puede identificar un Diseñador UX en una plataforma son: Incluir llamados a la acción (CTA) atractivos. Implementar un diseño web adaptable (Responsive Design). Incluir enlaces a redes sociales de la empresa. Optimizar la velocidad del sitio web. Utilizar, cuando sea necesario, imágenes y videos para ilustrar el sitio. "
            },
            {
                "id": 39,
                "Pregunta": "9. ¿Qué puntos consideras esenciales para lograr un diseño atractivo para el usuario?",
                "Respuesta": "Los elementos que brindan una estructura sólida y funcional a un diseño UX son los siguientes: Investigación de usuarios. Usabilidad del sitio web y/o aplicación móvil. Arquitectura de la información del sitio. Diseño de interfaz de usuario. Diseño de la interacción. Diseño de estrategias UX."
            },
            {
                "id": 40,
                "Pregunta": "10. ¿Qué consideras para elegir las características que debe de tener el diseño de un sitio web y/o aplicación móvil?",
                "Respuesta": "Factores externos que los diseñadores consideran para planificar y realizar un diseño UX son: El mercado objetivo de la empresa. Investigar las necesidades de las personas que forman parte del mercado objetivo. Plantear las características que resuelven el problema de dichas personas."
            }
        ]
    },{
        "bootcamp": "Data-Analytics",
        "questions": [
            {
                "id": 41,
                "Pregunta": "1. Mencione cuál es la responsabilidad de un data analyst. ",
                "Respuesta": "Solventar los problemas relacionados con el negocio de clientes y realizar auditorías de los datos. Analizar resultados obtenidos e interpretar datos usando técnicas estadísticas y suministrar informes consecutivamente. Jerarquizar las necesidades del negocio y trabajar en colaboración con las necesidades de gestión e información. Conocer los nuevos procesos o áreas de oportunidades y mejoras, de ser necesario. Identificar, analizar e interpretar patrones en conjuntos con datos complejos. Obtener datos de fuentes primarias o secundarias y sostener bases de datos y sistemas de datos. Filtrar, revisar y limpiar los datos informes del ordenador. Ubicar los indicadores de rendimiento para corregir problemas de código Desarrollar la base de datos a través del desarrollo de un sistema de entrada determinando así el nivel de acceso del usuario."
            },
            {
                "id": 42,
                "Pregunta": "2. ¿Qué se necesita para convertirse en un data analyst? ",
                "Respuesta": "Poseer conocimientos concretos sobre paquetes de informes como Objects, Business, un lenguaje de programación XML, Javascript, bases de datos SQL, SQLite, etc. Capacidad para recolectar, analizar, organizar, y diseminar grandes datos de forma precisa. Tener conocimientos técnicos en el diseño, modelos, y minería de bases de datos, así como técnicas de segmentación. Conocimiento concretos de paquetes estadísticos como: Excel, SPSS, SAS, etc."
            },
            {
                "id": 43,
                "Pregunta": "3. Mencione cuáles son los diferentes pasos de un proyecto de análisis. ",
                "Respuesta": "Definir el problema Explorar los datos Preparar los datos Modelar los datos Validar datos Seguimiento"
            },
            {
                "id": 44,
                "Pregunta": "4. Mencione lo que significa la limpieza de datos.",
                "Respuesta": "La limpieza de datos, trata de ubicar y quitar errores e inconsistencias de los datos con la finalidad de mejorar su calidad."
            },
            {
                "id": 45,
                "Pregunta": "5. Enumere algunas de las mejores prácticas para la limpieza de datos.",
                "Respuesta": "Colocar los datos por atributos distintos. Cuando son grandes conjuntos de datos, limpiar paso a paso, para lograr una mejor calidad. Cuando el conjunto de datos es grande, divide en grupos más pequeños. Trabajando con menor cantidad de datos, aumenta la velocidad de iteración. Para realizar tareas de limpieza común, crear un conjunto de funciones que sean útiles/herramienta/script. También se pueden ordenar por frecuencia estimada y atacar los problemas comunes Analizar estadísticas de resumen en cada columna (desviación media estándar, y número de valores perdidos. Realizar registro de operaciones de limpieza con fechas."
            },
            {
                "id": 46,
                "Pregunta": "6. Explica qué es la regresión logística. ",
                "Respuesta": "Es un método descriptivo basado en la estadística, que se utiliza para revisar un conjunto de datos donde hay una o más variables independientes que van a definir un resultado."
            },
            {
                "id": 47,
                "Pregunta": "7. Lista algunas de las mejores herramientas que pueden ser útiles para el análisis de datos. ",
                "Respuesta": "RapidMiner, NodeXL Tableau, KNIME, Google Search Operators OpenRefine, Google Fusion Tables,Wolfram Alpha's. Solver."
            },
            {
                "id": 48,
                "Pregunta": "8. Mencione cuál es la diferencia entre la minería de datos y la elaboración de perfiles de datos. ",
                "Respuesta": "Perfiles de datos: esta centrado en analizar las instancias de atributos individuales. Suministra información sobre distintos atributos como, ocurrencia de valores nulos, valor discreto y su frecuencia, rango de valores tipo de datos, longitud, etc. Minería de datos: Es el análisis de conglomerados, descubrimiento de secuencias, dependencias, detección de registros inusuales, mantenimiento de relaciones entre varios atributos, etc."
            },
            {
                "id": 49,
                "Type": "Array",
                "Pregunta": "9. Enumere algunos problemas comunes a los que se enfrentan los analistas de datos.",
                "Respuesta": ["1. Deficiencia en ortografía común.",
                            "2. Entradas dobles.", 
                            "3. Valores incompletos e ilegales.",
                            "4. Representaciones de valores que cambian.", 
                            "5. Descubrimientos de datos superpuestos."]
            },
            {
                "id": 50,
                "Pregunta": "10. Mencione el nombre del framework desarrollado por Apache para procesar grandes conjuntos de datos para una aplicación en un entorno de computación distribuido. ",
                "Respuesta": "Framework Hadoop y MapReduce."
            }
        ]
    }
]
}


